import AccordionItem from './AccordionItem.tsx';

const BlockFaq = () => {
  return (
    <div className="flex bg-bgSecondary text-secondary box-border border-0 shadow-lg rounded-md flex-col ">
      <AccordionItem
        title="Що таке псевдовипадкові бінарні послідовності?"
        description="
                 Псевдовипадкові бінарні послідовності є послідовністю бітів (0 і 1),
                 які здаються випадковими, але насправді генеруються за певним алгоритмом.
              "
      />
      <AccordionItem
        title="Де можуть знадобитися псевдовипадкові бінарні послідовності?"
        description="
                 Псевдовипадкові бінарні послідовності використовуються у різних галузях,
                 таких як криптографія, телекомунікації, тестування програмного забезпечення,
                 моделювання випадкових процесів та багатьох інших.
              "
      />
      <AccordionItem
        title="Які основні характеристики хороших псевдовипадкових бінарних послідовностей?"
        description="
                 Хороші псевдовипадкові бінарні послідовності повинні мати високий рівень випадковості,
                 рівномірний розподіл бітів, мінімальний коефіцієнт кореляції між бітами і максимальну довжину періоду.
              "
      />
      <AccordionItem
        title="Які типи послідовностей можна згенерувати за допомогою цього сервісу?"
        description="
                 Сервіс дозволяє генерувати послідовності над полем GF (2) з використанням
                 ЗРЗЗ та МРЗ, а також послідовності згенеровані
                 додаванням та множенням M-послідовностей та послідовності,
                 згенеровані з використанням МЗР з нормальною формою Фробеніуса.
              "
      />
      <AccordionItem
        title="Як зберегти результати створення для подальшого використання?"
        description="
                 Для збереження результатів створення вам необхідно зареєструватися на сайті.
                 Після цього ви зможете зберігати та керувати історією своїх запитів та даних для генерації послідовностей.
              "
      />
      <AccordionItem
        title="Яка інформація мені потрібна для використання генератора?"
        description="
                 Для використання генератора вам знадобляться параметри,
                 такі як ступінь полінома, сам поліном,
                 початковий стан та інші, залежно від типу генератора,
                 з яким ви працюєте. Поліноми будуть отримані з БД після того,
                 як ви оберете бажану ступінь.
              "
      />
    </div>
  );
};

export default BlockFaq;
