import Instruction from "./Instruction.tsx";
import linearImg from "../../../assets/imgs/linear-page.jpg"
import matrixImg from "../../../assets/imgs/matrix-page.jpg"
import sumProductImg from "../../../assets/imgs/sum-n-product-page.jpg"
import frobeniusImg from "../../../assets/imgs/frobenius-page.jpg"
import comparisonImg from "../../../assets/imgs/comparison-page.jpg"
const InstructionsBlock = () => {
  return (
    <div className="flex items-center flex-col gap-12">
      <Instruction
        title="Лінійний генератор"
        description="
                Для початку роботи з лінійним генератором перейдіть на відповідну сторінку.
                Виберіть бажаний ступінь полінома зі списку.
                Потім, у наступному списку, виберіть конкретний поліном,
                який відповідає вибраному ступеню.
                Після вибору полінома буде встановлено обмеження на довжину початкового стану.
                Зверніть увагу, що у полі початкового стану допускаються лише двійкові числа (0 або 1).
                Поточна та потрібна довжина початкового стану будуть відображені у правій частині поля.
                Після виконання цих дій ви можете створити послідовність, натиснувши відповідну кнопку.
              "
        picture={linearImg}
      />
      <Instruction
        title="Матричний генератор"
        description="
                Щоб використати матричний генератор, перейдіть на відповідну сторінку.
                Виберіть бажаний ступінь полінома для матриці A зі списку,
                а потім виберіть відповідний поліном.
                У третьому списку визначте, чи буде поліном циклічним.
                Повторіть подібні дії для матриці B.
                Перейдіть до центрального стовпця та
                оберіть індекси вихідних елементів та ранг матриці.
                Зверніть увагу,
                що вибір I-го елемента можливий тільки після вибору ступеня для матриці A,
                і аналогічно для J-го елемента та матриці B.
                Також для вибору рангу матриці потрібно визначити ступені для обох матриць.
                Після виконання цих дій ви можете створити послідовність, натиснувши відповідну кнопку.
              "
        picture={matrixImg}
        reverse
      />
      <Instruction
        title="Генератор сум та добутків"
        description="
                Для початку роботи з генератором сум та добутків перейдіть на відповідну сторінку.
                Оскільки цей генератор базується на лінійних генераторах,
                виконайте алгоритм, що описаний у першому підрозділі.
                Зверніть увагу, щоб виконати генерацію послідовностей,
                згенеровані періоди повинні бути взаємно простими.
                Якщо ця умова не виконана, ви отримаєте повідомлення із попередженням про це.
                Якщо умова виконується, відобразиться кнопка для генерації.
                Натисніть на неї,
                щоб отримати результат генерації послідовностей.
              "
        picture={sumProductImg}
      />
      <Instruction
        title="МЗР з матрицею Фробеніуса"
        description="
                Для початку роботи з генератором з матрицею Фробеніуса перейдіть на відповідну сторінку.
                Оберіть ступінь та поліном, який віповідає цьому ступеню.
                Виконайте розбиття на допоміжні поліноми
                за ступенем обраного полінома у форматі n-m-...-k.
                Після цього оберіть поліноми, яки відповідають розбиттю.
                Наступним кроком оберіть індекси вихідних елементів.
                Після цих етапів можна виконати генерацію ПВП,
                щоб зробите це натисність кнопку для генерації.
              "
        picture={frobeniusImg}
        reverse
      />
      <Instruction
        title="Порівняння генераторів"
        description="
                Щоб проаналізувати властивості двох генераторів,
                перейдіть на відповідну сторінку.
                У порівнянні беруть участь лінійний та матричний генератори,
                тому для роботи з ними дотримуйтесь алгоритмів,
                описаних у першому та другому підрозділах відповідно.
                Щоб порівняти кореляцію, натисніть кнопку генерації без додаткових дій.
                Якщо бажаєте порівняти вагу Хеммінга, введіть довжину блоку,
                в якому потрібно розрахувати вагу, та натисніть відповідну кнопку.
                Щоб переключитися між графіками натисніть кнопку з відповідною назвою.
              "
        picture={comparisonImg}
      />
    </div>
  );
};

export default InstructionsBlock;
